In [ ]:
import os
os.listdir()

In [2]:
%matplotlib inline
import pandas as pd

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [4]:
print("There are ",titles["title"].size," Movies in that dataset")

There are  244914  Movies in that dataset

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles.sort_values("year").head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
ham=titles[titles['title']=='Hamlet']
ham.shape[0]

20

### How many movies are titled "North by Northwest"?

In [7]:
Nor=titles[titles['title']=='North by Northwest']
Nor.shape[0]

1

### When was the first movie titled "Hamlet" made?

In [8]:
titles[titles['title']=="Hamlet"].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
titles[titles['title']=="Treasure Island"].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
titles[titles['year']==1950].count()

title    1113
year     1113
dtype: int64

### How many movies were made in the year 1960?

In [11]:
titles[titles['year']==1960].count()

title    1549
year     1549
dtype: int64

### How many movies were made from 1950 through 1959?

In [12]:
titles[(titles['year']>=1950) & (titles['year']<1960) ].count()

title    12934
year     12934
dtype: int64

### In what years has a movie titled "Batman" been released?

In [13]:
titles[titles['title']=="Batman"].sort_values('year')

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [14]:
cast=pd.read_csv("cast.csv")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [15]:
cast[cast["title"]=="Inception"]['character'].count()

78

In [16]:
cast[cast["title"]=="Inception"]['character'].nunique()

56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [17]:
cast[cast["title"]=="Inception"]['n'].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [18]:
cast[cast["title"]=="Inception"]['n'].shape[0]-cast[cast["title"]=="Inception"]['n'].isna().sum()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [19]:
x=cast[cast["title"]=="North by Northwest"].dropna()

In [20]:
x.sort_values("n")[["name","n"]]

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [21]:
x=cast[(cast["title"]=="Sleuth") & (cast['year']==1972)]

In [22]:
x.sort_values("n")

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [23]:
x=cast[(cast["title"]=="Sleuth") & (cast['year']==2007)]

In [24]:
x.sort_values("n").dropna()

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [25]:
x=cast[(cast["title"]=="Hamlet") & (cast['year']==1921)]

In [26]:
x["character"].count()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [27]:
x=cast[(cast["title"]=="Hamlet") & (cast['year']==1996)]

In [28]:
x["character"].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [29]:
x=cast[(cast["title"]=="Hamlet")]
x["character"].count()

342

### How many people have played an "Ophelia"?

In [30]:
x=cast[(cast["title"]=="Ophelia")]
x["character"].count()

20

### How many people have played a role called "The Dude"?

In [31]:
x=cast[(cast["character"]=="The Dude")]
x.shape[0]

19

### How many people have played a role called "The Stranger"?

In [32]:
x=cast[(cast["character"]=="The Stranger")]
x.shape[0]

212

### How many roles has Sidney Poitier played throughout his career?

In [33]:
x=cast[(cast["name"]=="Sidney Poitier")]
x.shape[0]

43

### How many roles has Judi Dench played?

In [34]:
x=cast[(cast["name"]=="Judi Dench")]
x.shape[0]

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [35]:
cast[(cast["name"]=="Cary Grant") & (cast["n"]==2)& (cast['year']>=1940)].shape[0]

2

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [36]:
x=cast[(cast["name"]=="Cary Grant") & (cast['year']>=1940) & (cast['year']<=1949)]
x.sort_values("year")

,title,year,name,type,character,n
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871433,Penny Serenade,1941,Cary Grant,actor,Roger Adams,2.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871405,George White's Scandals,1945,Cary Grant,actor,Cary Grant,NaN
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871466,Without Reservations,1946,Cary Grant,actor,Cary Grant,NaN
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [37]:
cast[(cast["type"]=="actor") & (cast['year']>=1950) & (cast['year']<=1959)].shape[0]

157738

### How many roles were available for actresses in the 1950s?

In [38]:
cast[(cast["type"]=="actress") & (cast['year']>=1950) & (cast['year']<=1959)].shape[0]

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [39]:
cast[(cast.n==1) & (cast.year<=1980)].shape[0]

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [40]:
cast[(cast.n!=1) & (cast.year<1980)].shape[0]

1095378

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [41]:
cast[(cast['n'].isna()) & (cast.year<=1980)].shape[0]

448347